---
title: "Cr√©er un serveur NTP avec Chrony et synchroniser ses √©quipements "
date: 2023-01-06T09:24:04+01:00
FRtags: ["chrony", "linux", "cisco"] 
---

‚ö† **J'utilise une machine Debian pour mon serveur Chrony, les commandes pr√©sent√©s ne sont donc valide que pour Linux.**

## A faire sur votre serveur (Linux ou Windows)

Tout d'abord, installer Chrony:

```
sudo -s
apt install chrony
```

On peut ensuite v√©rifier le contenu du fichier "chrony.conf"

```
nano /etc/chrony/chrony.conf
```

Ensuite nous devons d√©clarer nos pool NTP. Nous allons nous rendre √† la ligne 3 du fichier pour faire quelques modification :

`pool 2.debian.pool.ntp.org iburst`

devient:

`#pool 2.debian.pool.ntp.org iburst`

et maintenant nous pouvons ajouter nos pools en entrant les lignes suivantes √† la place :

```
server 0.fr.pool.ntp.org
server 1.fr.pool.ntp.org
server 2.fr.pool.ntp.org
server 3.fr.pool.ntp.org
```

Une fois cela fait on va pouvoir se rendre un peut plus bas pour v√©rifier l'existance (ou non) des lignes suivantes:

```
# This directive specify the file into which chronyd will store the rate
# information.
driftfile /var/lib/chrony/chrony.drift
local stratum 8
manual
allow 172.25
``` 
Si ces lignes ne sont pas pr√©sentes, il faudra les modifier comme ci-dessus.

Le  `local stratum 8` d√©clare la "couche" de notre serveur NTP. Pour terminer cette installation il faut lancer le serveur.

```
systemctl start chrony
```

on v√©rifie que le service s'est lanc√© correctement :

```
systemctl status chrony
```

Et enfin la commande qui sert √† activer le service √† chaque fois que la machine est allum√©e :

```
systemctl enable chrony
```

## A faire sur votre √©quipement (ici ce sera un switch Cisco)

***Article tir√© de IT-Connect.fr, par Florian Burnel***

Pour le moment, le routeur n'est pas synchronis√© via le serveur NTP, on peut consulter l'heure actuelle gr√¢ce √† la commande "show clock", on remarque que l'heure n'est pas bonne du tout...

```
SwitchToto#show clock
*0:8:8.942 UTC Mon Mar 1 1993
```
Passons √† la configuration, tr√®s simple puisqu'il suffit d'indiquer l'adresse du serveur NTP. Voici la proc√©dure de configuration :

```
Router#configure terminal
Enter configuration commands, one per line. End with CNTL/Z.
Router(config)#ntp server 192.168.1.10
Router(config)#exit
```

On peut v√©rifier que notre switch est bien associ√© au serveur ntp:

```
Router#show ntp association
```

Affichez √† nouveau la date et l'heure, normalement elle doit √™tre actualis√©e :

```
Router#show clock
*11:51:11.134 UTC Fri Jan 1 2023
```

Et vos √©quipements sont bien synchronis√© entre eux! 


Merci √† **[Enzo Ribeiro](https://enzo-ribeiro.github.io/portfolio)** pour son aide. üòä

