---
title: "Etablir une connexion SSH sur un appareil Cisco"
date: 2022-11-29T10:04:21+01:00
FRtags: ["cisco", "SSH"]
---

## Cr√©ation de noms d'utilisateurs, de domaines, et de cl√©s ##

(Nous prenons ici l'exemple d'un router Cisco.)

Tout d'abord, si √ßa n'est pas d√©ja fait, donner un nom personnalis√© ainsi qu'un nom de domaine DNS √† votre appareil:

```
Router(config)# hostname Toto
Toto(config)# ip domain-name exemple.com

```
*(si vous voulez faire votre propre serveur DNS Linux, j'ai fait un tuto [ici](/fr/notes/linux-dns/) )*    

Pensez √† s√©curiser le mode privil√©gi√© de votre appareil ! 

```
Toto(config)# enable secret <mot_de_passe>
```
Ensuite, nous devons dire √† notre routeur (ou switch) de g√©n√©rer une paire de cl√©s asym√©trique (n√©cessaire √† la connexion SSH).
Il faut aussi chiffrer ces cl√©s, on va pour cela utiliser le protocole RSA:

```
Toto(config)# crypto key generate rsa
```
On va ensuite nous demander la taille voulu de la cl√©. Personnellement je met `1024` bits.

```
The name for the keys will be: Toto.exemple.com
Choose the size of the key modulus in the range of 360 to 2048 for your
General Purpose Keys. Choosing a key modulus greater than 512 may take a few minutes.

How many bits in the modulus [512]: 1024
% Generating 1024 bit RSA keys, keys will be non-exportable. . . [OK]

Toto(config)# 

```
On va maintenant cr√©er un utilisateur, c'est avec ses logins que l'on pourra se connecter au routeur (ou switch) √† distance. 
Ici, j'ai mis `thomas` pour le username et `admin` pour le mot de passe, **mais vous mettrez √©videmment les valeurs que vous voulez.**

```
Toto(config)# username thomas password admin

```
## Activation du protocole SSH ##

On peut maintenant activer le protocole SSH sur notre routeur (ou switch): 

```
Toto(config)# ip ssh version 2
```
### Petite parenth√®se sur les commandes qui vont suivre: ###

Pour se connecter sur appareil √† distance, il y a deux protocoles principaux: `Telnet` et `SSH`. Telnet est un protocole simple qui fonctionne bien, mais qui n'est pas du tout s√©curis√© et crypt√©: c'est √† dire que n'importe qui peut intercepter les trames de communication entre vous et l'appareil.    

SSH est quand lui crypt√© (gr√¢ce aux cl√©s que nous avons g√©n√©r√© plus t√¥t). La norme veut donc que l'on force notre switch √† ne communiquer qu'en SSH, et que la connexion en Telnet soit impossible (pour plus de s√©curit√©).

C'est ce que l'on va faire maintenant.

On va d'abord forcer notre switch √† n'accepter que la communication entrante en SSH: 
```
Toto(config)# line vty 0 4
Toto(config)# login local
Toto(config-line)# transport input ssh

```
Puis on fait de m√™me pour la communication sortante: 
```
Toto(config-line)# transport output ssh
```

Maintenant, on peut v√©rifier les changement de configuration:

```
Toto# show running-config

```

N'oubliez pas de sauvegarder la nouvelle configuration ! 

```
Toto# copy running-config startup-config 

```

## Test de connexion (avec PuTTy) ##

PuTTy est un logiciel gratuit qui permet de se connecter √† un appareil de plein de mani√®res diff√©rentes: c√¢ble s√©rie, Telnet, SSH...    
Vous pouvez donc s√©lectionner SSH, puis rentrer l'addresse IP de votre appareil Cisco (la mienne √©tait 192.168.100.33):
![putty](/images/putty.PNG)

On va alors vous demander un username. Vous pouvez mettre celui que vous avez cr√©√© pr√©c√©demment (dans mon cas `thomas`).
Ensuite vous pouvez rentrer le mot de passe correspondant √† cet utilisateur (pour moi c'est donc `admin`).    
   
Et vous √™tes enfin connect√© !    

![ssh](/images/ssh.PNG)

Un mot de passe vous sera demand√© si vous voulez rentrer en mode privil√©gi√©. C'est celui que vous avez mis lors de la commande `enable secret <mot_de_passe>` 

C'est tout pour la connexion SSH sur Cisco üòÅ!  


