---
title: "Configuration de base pour un commutateur Cisco "
date: 2022-11-17T13:39:04+01:00
FRtags: ["cisco", "configuration"] 
---

## Configuration basique ##

Passer en mode privil√©gi√©, puis configuration du terminal:

```
Switch>en
    
Switch#conf t

```
D√©finir le nom du switch,  ainsi que le domaine auquel il appartient (optionnel).

```
Switch(config)#

Switch(config)# hostname SwitchToto

SwitchToto(config)# ip domain-name exempledomaine.local

SwitchToto(config)# end

```
D√©finir l'addressage IP du switch. Pour cela, on doit cr√©er un VLAN d√©di√© √† la configuration du switch (ici le vlan 10).
L'IP que nous allons d√©finir sera donc associ√© √† ce VLAN.
Cr√©er le VLAN: 

```
SwitchToto(config)# vlan 10
SwitchToto(config-vlan)# exit

```
Puis d√©finir la configuration IP:
- Addresse IP: 192.168.10.1
- Masque de sous-r√©seau: 255.255.255.0
- Passerelle par d√©faut: 192.168.10.254

```
SwitchToto(config)# interface vlan 10 
SwitchToto(config-if)# ip address 192.168.10.1 255.255.255.0
SwitchToto(config-if)# ex
SwitchToto(config)# ip default-gateway 192.168.10.254

```
Pour voir la configuration de notre vlan d'administration:
```
SwitchToto# sh run int vlan 10

```
Pour supprimer l'addresse IP, son masque, ainsi que la passerelle par d√©faut:

```
SwitchToto(config)# interface vlan 10
SwitchToto(config-if)# no ip address
SwitchToto(config-if)# ex
SwitchToto(config)# no ip default-gateway
```
Il faut maintenant s√©curiser notre Switch.    
***M√™me si cette √©tape est optionnelle, je vous la recommande fortement.***     

On va tout d'abord masquer les futurs mots de passe que nous allons mettre sur ce switch, de mani√®re √† ce qu'ils ne s'affichent pas √† l'√©cran m√™me lors d'un `show running config`. On va donc ajouter le service **password-encryption**.


```
Switch(config)# service password-encryption

```
Puis nous pouvons d√©finir le mot de passe qui sera demand√© lorsque l'on voudra acc√®der au mode priviligi√©:

```
SwitchToto(config)# enable secret P@55w0rd

```
D√©sormais, si je veux rentrer dans le mode privil√©gi√©, il faudra que j'inscrive le mot de passe "P@55w0rd" (qui est d'ailleur un tr√®s mauvais mot de passe).


## Sauvegarder la configuration ##

### Explication ###
Les commutateur Cisco poss√®de 2 configurations: la "running-config" et la "startup-config". Lorsque le switch d√©marre, il utilise sa "startup-config". Si des changements de configuration sont cr√©es, ils se feront dans la "running-config". Le commutateur utilisera alors sa "running-config".    
En revanche, si les changements op√©r√©s se r√©velent √™tre un √©chec, il suffit 
de le red√©marrer. Ainsi, le switch utilisera sa "startup-config", qui n'a donc pas chang√©e.    
Lorsque l'on est certain des changements faits, on peut copier la "running-config" dans la "startup-config". Les changements seront alors pris en compte dans la config par d√©faut, de d√©marrage, du commutateur.

### Commandes ###

```
SwitchToto# copy running-config starting-config

Destination filename [startup-config]?

Building configuration...

[OK]
0 bytes copied in 0.923 secs (0 bytes/sec)

SwitchToto# write

Building configuration...

[OK]

SwitchToto#

```

Vous devriez maintenant avoir un switch configur√© et s√©curis√© ! üòä

